app/controllers/attacks_controller.rb

  def index
    @attacks = Attack.paginate(:page => params[:page], :per_page => 15)
---
SELECT "attacks".* FROM "attacks"

    else
      registrar_name = "Unknown"
    end
    Registrar.create(name: registrar_name, attackID: params[:attack][:attackID])
---
INSERT INTO "attacks" ("case_id", "client", "attack_type", "url", "detection_time", "detection_method", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    puts "\n\n\n\nwtf: #{attack_params}\n\n\n\n"
    respond_to do |format|
      if @attack.update(attack_params)
---
UPDATE "attacks" SET "case_id" = ?, "updated_at" = ? WHERE "attacks"."id" = ?  [["case_id", "CID10000"], ["updated_at", "2015-12-25 08:13:08.012440"], ["id", 1]]

    def set_attack
      @attack = Attack.find(params[:id])
---
SELECT  "attacks".* FROM "attacks" WHERE "attacks"."id" = ? LIMIT 1  [["id", 1]]